Ran Plan for dir: `test/resource` workspace: `default`

<details><summary>Show Output</summary>

```diff
No resources to import


[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v3.51.0

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
No resources to import


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket_object.this[0] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "lucy-test-hs"
      + bucket_key_enabled     = (known after apply)
      + content                = "dummy"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "dummy_file.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + s3_bucket_object_etag       = (known after apply)
  + s3_bucket_object_id         = (known after apply)
  + s3_bucket_object_version_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /Users/lucy/.atlantis/repos/hs-llu/terragrunt-test/16/default/test/resource/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/lucy/.atlantis/repos/hs-llu/terragrunt-test/16/default/test/resource/default.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d test/resource`
* :put_litter_in_its_place: To **delete** this plan click [here](http://7f2aea0c360b.ngrok.io/lock?id=hs-llu%252Fterragrunt-test%252Ftest%252Fresource%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d test/resource`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
